app/views/gossip/index.html.erb

  <div class="card-body">
    <h5 class="card-title"> Author : <%= gossip.user.first_name %> </h5>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]