app/views/gossip/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  <ul class="list-group list-group-flush">
    <li class="list-group-item"> Author : <%= @gossip.user.first_name %> </li>

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    <li class="list-group-item">Content : <%= @gossip.content%></li>
    <li class="list-group-item">City : <%= City.find_by(id: @user.city_id).name %> </li>

SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 1]]
---
<h3>User Comment</h3>
<%= @gossip.comments.each do |comment| %>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
<div class="panel-heading">
<strong>  <%= comment.user.first_name %> : </strong>