app/views/user/show.html.erb

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    <li class="list-group-item"> Age : <%= @user.age %> </li>
    <li class="list-group-item"> Ville : <%= City.find_by(id: @user.city_id).name %> </li>