app/controllers/city_controller.rb

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "gossips".* FROM "gossips"
---
	def show
		@city = City.find(params[:id])
		@gossip = Gossip.all