app/controllers/comment_controller.rb

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."first_name" = $1 LIMIT $2  [["first_name", "Anonymous"], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "gossip_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "sssss"], ["gossip_id", 4], ["author_id", 11], ["created_at", "2019-05-01 18:28:48.369683"], ["updated_at", "2019-05-01 18:28:48.369683"]]
---
	def create
		@gossip = Gossip.find(params['gossip_id'])
    	@comment = Comment.new(content: params[:content], author: User.find_by(first_name: "Anonymous"), gossip: @gossip)
    	if @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "comments" SET "content" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["content", "hhhh"], ["updated_at", "2019-05-01 19:16:01.021054"], ["id", 7]]
---
	def update
		@comment = Comment.find(params[:id])
		if @comment.update(content: params[:content], author: @comment.author, gossip: @comment.gossip)

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 6]]
---
	def destroy
		@comment = Comment.find(params[:id])
		gossip = @comment.gossip
		@comment.destroy