app/controllers/gossip_controller.rb

	def create
		user = User.find_by(first_name: "Anonymous")
		@gossip = Gossip.new(title: params[:title], content: params[:content], user: user)
    if @gossip.save
---
SELECT  "users".* FROM "users" WHERE "users"."first_name" = $1 LIMIT $2  [["first_name", "Anonymous"], ["LIMIT", 1]]
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "ce site est cool"], ["content", "n'est ce pas ?"], ["user_id", 11], ["created_at", "2019-05-02 11:05:49.768767"], ["updated_at", "2019-05-02 11:05:49.768767"]]

	def show
		@gossip = Gossip.find(params[:id])
		@user = User.find_by(id: @gossip.user_id)
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def update
		@gossip = Gossip.find(params[:id])
		if @gossip.update(gossip_params)
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "gossips" SET "content" = $1, "updated_at" = $2 WHERE "gossips"."id" = $3  [["content", "Life is just one crushing defeat after another :)until you just wish Flanders was dead."], ["updated_at", "2019-05-01 15:55:26.583369"], ["id", 1]]