app/controllers/user_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
	def welcome
		 @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def show
		@user = User.all
		@user = User.find(params[:id])

SELECT "cities".* FROM "cities"
INSERT INTO "users" ("first_name", "last_name", "description", "email", "age", "city_id", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
	def create
		@user = User.new(
			first_name: params[:first_name],
			last_name: params[:last_name],
			description: params[:description],
			email: params[:email],
			age: params[:age],
			city_id: City.all.sample.id,
			password: params[:password],
			password_confirmation: params[:password_confirmation])
		if @user.save